{
  "chapter-1a": {
    "id": "chapter-1a",
    "title": "The Forest Path",
    "html": "<p>You decide to take the forest path. The trees tower above you, their leaves rustling in the gentle breeze. The air is cool and filled with the scent of pine and earth.</p>\n<p>As you venture deeper into the woods, you come across a fork in the path. Sunlight filters through the canopy, creating dappled patterns on the forest floor.</p>\n<p>To the left, the path seems to lead deeper into the forest, where the trees grow closer together and the light dims.</p>\n<p>To the right, the path appears to wind around the base of the mountain.</p>\n<p>There&#39;s also the option to return to the crossroads if you&#39;ve changed your mind.</p>\n",
    "next": [
      {
        "id": "chapter-2a",
        "label": "Take the path to the left",
        "condition": "choice.path === 'forest'"
      },
      {
        "id": "chapter-2b",
        "label": "Take the path to the right",
        "condition": "choice.path === 'mountain'"
      },
      {
        "id": "index",
        "label": "Return to the crossroads"
      }
    ],
    "set": [],
    "condition": null,
    "theme": "global"
  },
  "chapter-1b": {
    "id": "chapter-1b",
    "title": "The Mountain Trail",
    "html": "<p>You choose the mountain trail. The steep path winds its way up the rocky slopes. From here, you can see the valley spreading out below you, a breathtaking vista of forests and fields.</p>\n<p>After climbing for a while, you stop to catch your breath and consider your next move. The air is thinner here, but crisp and clear. You can see for miles in every direction.</p>\n<p>The trail continues upward, disappearing around a bend. It looks challenging but potentially rewarding. However, you&#39;re also feeling a bit tired from the climb so far.</p>\n<p>Perhaps returning to the crossroads might be the wiser choice for now.</p>\n",
    "next": [
      {
        "id": "index",
        "label": "Return to the crossroads"
      }
    ],
    "set": [],
    "condition": null,
    "theme": "global"
  },
  "index": {
    "id": "index",
    "title": "The Journey Begins",
    "html": "<div class=\"container h-screen flex flex-col item-center justify-center\">\n  <h1>The Journey Begins</h1>\n\n<p>  Welcome to your adventure! You stand at a crossroads, with two paths stretching before you.\n\nTo the left, a path winds its way into a dense, mysterious forest. To the right, a trail climbs up the side of a majestic mountain.\n\nWhich path will you choose?\n</p>\n  <div class=\"right-choices\">\n    \n      <button data-scene-id=\"chapter-1a\">Take the forest path</button>\n    \n      <button data-scene-id=\"chapter-1b\">Take the mountain trail</button>\n    \n  </div>\n</div>\n",
    "next": [
      {
        "id": "chapter-1a",
        "label": "Take the forest path"
      },
      {
        "id": "chapter-1b",
        "label": "Take the mountain trail"
      }
    ],
    "set": [],
    "condition": null,
    "theme": "global"
  }
}